---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemTypeWarning
source: html/5f8f992d-2534-dbfb-453f-acf55d7470b5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemTypeWarning Property

The selected fixture is part of a different system. You may want to edit the system type and merge two systems.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchedSystemTypeWarning { get; }
```